GopalSaraf/Practicals/PSDL/include/proc/pic16f1575.inc
// Register: PWM3OFL
#define PWM3OFL PWM3OFL
PWM3OFL                                  equ 0DB7h
// bitfield definitions
PWM3OFL_OF_POSN                          equ 0000h
PWM3OFL_OF_POSITION                      equ 0000h
PWM3OFL_OF_SIZE                          equ 0008h
PWM3OFL_OF_LENGTH                        equ 0008h
PWM3OFL_OF_MASK                          equ 00FFh
PWM3OFL_PWM3OFL0_POSN                    equ 0000h
PWM3OFL_PWM3OFL0_POSITION                equ 0000h
PWM3OFL_PWM3OFL0_SIZE                    equ 0001h
PWM3OFL_PWM3OFL0_LENGTH                  equ 0001h
PWM3OFL_PWM3OFL0_MASK                    equ 0001h
PWM3OFL_PWM3OFL1_POSN                    equ 0001h
PWM3OFL_PWM3OFL1_POSITION                equ 0001h
PWM3OFL_PWM3OFL1_SIZE                    equ 0001h
PWM3OFL_PWM3OFL1_LENGTH                  equ 0001h
PWM3OFL_PWM3OFL1_MASK                    equ 0002h
PWM3OFL_PWM3OFL2_POSN                    equ 0002h
PWM3OFL_PWM3OFL2_POSITION                equ 0002h
PWM3OFL_PWM3OFL2_SIZE                    equ 0001h
PWM3OFL_PWM3OFL2_LENGTH                  equ 0001h
PWM3OFL_PWM3OFL2_MASK                    equ 0004h
PWM3OFL_PWM3OFL3_POSN                    equ 0003h
PWM3OFL_PWM3OFL3_POSITION                equ 0003h
PWM3OFL_PWM3OFL3_SIZE                    equ 0001h
PWM3OFL_PWM3OFL3_LENGTH                  equ 0001h
PWM3OFL_PWM3OFL3_MASK                    equ 0008h
PWM3OFL_PWM3OFL4_POSN                    equ 0004h
PWM3OFL_PWM3OFL4_POSITION                equ 0004h
PWM3OFL_PWM3OFL4_SIZE                    equ 0001h
PWM3OFL_PWM3OFL4_LENGTH                  equ 0001h
PWM3OFL_PWM3OFL4_MASK                    equ 0010h
PWM3OFL_PWM3OFL5_POSN                    equ 0005h
PWM3OFL_PWM3OFL5_POSITION                equ 0005h
PWM3OFL_PWM3OFL5_SIZE                    equ 0001h
PWM3OFL_PWM3OFL5_LENGTH                  equ 0001h
PWM3OFL_PWM3OFL5_MASK                    equ 0020h
PWM3OFL_PWM3OFL6_POSN                    equ 0006h
PWM3OFL_PWM3OFL6_POSITION                equ 0006h
PWM3OFL_PWM3OFL6_SIZE                    equ 0001h
PWM3OFL_PWM3OFL6_LENGTH                  equ 0001h
PWM3OFL_PWM3OFL6_MASK                    equ 0040h
PWM3OFL_PWM3OFL7_POSN                    equ 0007h
PWM3OFL_PWM3OFL7_POSITION                equ 0007h
PWM3OFL_PWM3OFL7_SIZE                    equ 0001h
PWM3OFL_PWM3OFL7_LENGTH                  equ 0001h
PWM3OFL_PWM3OFL7_MASK                    equ 0080h
PWM3OFL_PWM3OFL_POSN                     equ 0000h
PWM3OFL_PWM3OFL_POSITION                 equ 0000h
PWM3OFL_PWM3OFL_SIZE                     equ 0008h
PWM3OFL_PWM3OFL_LENGTH                   equ 0008h
PWM3OFL_PWM3OFL_MASK                     equ 00FFh

// Register: PWM3OFH
#define PWM3OFH PWM3OFH
PWM3OFH                                  equ 0DB8h
// bitfield definitions
PWM3OFH_OF_POSN                          equ 0000h
PWM3OFH_OF_POSITION                      equ 0000h
PWM3OFH_OF_SIZE                          equ 0008h
PWM3OFH_OF_LENGTH                        equ 0008h
PWM3OFH_OF_MASK                          equ 00FFh
PWM3OFH_PWM3OFH0_POSN                    equ 0000h
PWM3OFH_PWM3OFH0_POSITION                equ 0000h
PWM3OFH_PWM3OFH0_SIZE                    equ 0001h
PWM3OFH_PWM3OFH0_LENGTH                  equ 0001h
PWM3OFH_PWM3OFH0_MASK                    equ 0001h
PWM3OFH_PWM3OFH1_POSN                    equ 0001h
PWM3OFH_PWM3OFH1_POSITION                equ 0001h
PWM3OFH_PWM3OFH1_SIZE                    equ 0001h
PWM3OFH_PWM3OFH1_LENGTH                  equ 0001h
PWM3OFH_PWM3OFH1_MASK                    equ 0002h
PWM3OFH_PWM3OFH2_POSN                    equ 0002h
PWM3OFH_PWM3OFH2_POSITION                equ 0002h
PWM3OFH_PWM3OFH2_SIZE                    equ 0001h
PWM3OFH_PWM3OFH2_LENGTH                  equ 0001h
PWM3OFH_PWM3OFH2_MASK                    equ 0004h
PWM3OFH_PWM3OFH3_POSN                    equ 0003h
PWM3OFH_PWM3OFH3_POSITION                equ 0003h
PWM3OFH_PWM3OFH3_SIZE                    equ 0001h
PWM3OFH_PWM3OFH3_LENGTH                  equ 0001h
PWM3OFH_PWM3OFH3_MASK                    equ 0008h
PWM3OFH_PWM3OFH4_POSN                    equ 0004h
PWM3OFH_PWM3OFH4_POSITION                equ 0004h
PWM3OFH_PWM3OFH4_SIZE                    equ 0001h
PWM3OFH_PWM3OFH4_LENGTH                  equ 0001h
PWM3OFH_PWM3OFH4_MASK                    equ 0010h
PWM3OFH_PWM3OFH5_POSN                    equ 0005h
PWM3OFH_PWM3OFH5_POSITION                equ 0005h
PWM3OFH_PWM3OFH5_SIZE                    equ 0001h
PWM3OFH_PWM3OFH5_LENGTH                  equ 0001h
PWM3OFH_PWM3OFH5_MASK                    equ 0020h
PWM3OFH_PWM3OFH6_POSN                    equ 0006h
PWM3OFH_PWM3OFH6_POSITION                equ 0006h
PWM3OFH_PWM3OFH6_SIZE                    equ 0001h
PWM3OFH_PWM3OFH6_LENGTH                  equ 0001h
PWM3OFH_PWM3OFH6_MASK                    equ 0040h
PWM3OFH_PWM3OFH7_POSN                    equ 0007h
PWM3OFH_PWM3OFH7_POSITION                equ 0007h
PWM3OFH_PWM3OFH7_SIZE                    equ 0001h
PWM3OFH_PWM3OFH7_LENGTH                  equ 0001h
PWM3OFH_PWM3OFH7_MASK                    equ 0080h
PWM3OFH_PWM3OFH_POSN                     equ 0000h
PWM3OFH_PWM3OFH_POSITION                 equ 0000h
PWM3OFH_PWM3OFH_SIZE                     equ 0008h
PWM3OFH_PWM3OFH_LENGTH                   equ 0008h
PWM3OFH_PWM3OFH_MASK                     equ 00FFh

// Register: PWM3TMRL
#define PWM3TMRL PWM3TMRL
PWM3TMRL                                 equ 0DB9h
// bitfield definitions
PWM3TMRL_TMR_POSN                        equ 0000h
PWM3TMRL_TMR_POSITION                    equ 0000h
PWM3TMRL_TMR_SIZE                        equ 0008h
PWM3TMRL_TMR_LENGTH                      equ 0008h
PWM3TMRL_TMR_MASK                        equ 00FFh
PWM3TMRL_PWM3TMRL0_POSN                  equ 0000h
PWM3TMRL_PWM3TMRL0_POSITION              equ 0000h
PWM3TMRL_PWM3TMRL0_SIZE                  equ 0001h
PWM3TMRL_PWM3TMRL0_LENGTH                equ 0001h
PWM3TMRL_PWM3TMRL0_MASK                  equ 0001h
PWM3TMRL_PWM3TMRL1_POSN                  equ 0001h
PWM3TMRL_PWM3TMRL1_POSITION              equ 0001h
PWM3TMRL_PWM3TMRL1_SIZE                  equ 0001h
PWM3TMRL_PWM3TMRL1_LENGTH                equ 0001h
PWM3TMRL_PWM3TMRL1_MASK                  equ 0002h
PWM3TMRL_PWM3TMRL2_POSN                  equ 0002h
PWM3TMRL_PWM3TMRL2_POSITION              equ 0002h
PWM3TMRL_PWM3TMRL2_SIZE                  equ 0001h
PWM3TMRL_PWM3TMRL2_LENGTH                equ 0001h
PWM3TMRL_PWM3TMRL2_MASK                  equ 0004h
PWM3TMRL_PWM3TMRL3_POSN                  equ 0003h
PWM3TMRL_PWM3TMRL3_POSITION              equ 0003h
PWM3TMRL_PWM3TMRL3_SIZE                  equ 0001h
PWM3TMRL_PWM3TMRL3_LENGTH                equ 0001h
PWM3TMRL_PWM3TMRL3_MASK                  equ 0008h
PWM3TMRL_PWM3TMRL4_POSN                  equ 0004h
PWM3TMRL_PWM3TMRL4_POSITION              equ 0004h
PWM3TMRL_PWM3TMRL4_SIZE                  equ 0001h
PWM3TMRL_PWM3TMRL4_LENGTH                equ 0001h
PWM3TMRL_PWM3TMRL4_MASK                  equ 0010h
PWM3TMRL_PWM3TMRL5_POSN                  equ 0005h
PWM3TMRL_PWM3TMRL5_POSITION              equ 0005h
PWM3TMRL_PWM3TMRL5_SIZE                  equ 0001h
PWM3TMRL_PWM3TMRL5_LENGTH                equ 0001h
PWM3TMRL_PWM3TMRL5_MASK                  equ 0020h
PWM3TMRL_PWM3TMRL6_POSN                  equ 0006h
PWM3TMRL_PWM3TMRL6_POSITION              equ 0006h
PWM3TMRL_PWM3TMRL6_SIZE                  equ 0001h
PWM3TMRL_PWM3TMRL6_LENGTH                equ 0001h
PWM3TMRL_PWM3TMRL6_MASK                  equ 0040h
PWM3TMRL_PWM3TMRL7_POSN                  equ 0007h
PWM3TMRL_PWM3TMRL7_POSITION              equ 0007h
PWM3TMRL_PWM3TMRL7_SIZE                  equ 0001h
PWM3TMRL_PWM3TMRL7_LENGTH                equ 0001h
PWM3TMRL_PWM3TMRL7_MASK                  equ 0080h
PWM3TMRL_PWM3TMRL_POSN                   equ 0000h
PWM3TMRL_PWM3TMRL_POSITION               equ 0000h
PWM3TMRL_PWM3TMRL_SIZE                   equ 0008h
PWM3TMRL_PWM3TMRL_LENGTH                 equ 0008h
PWM3TMRL_PWM3TMRL_MASK                   equ 00FFh

// Register: PWM3TMRH
#define PWM3TMRH PWM3TMRH
PWM3TMRH                                 equ 0DBAh
// bitfield definitions
PWM3TMRH_TMR_POSN                        equ 0000h
PWM3TMRH_TMR_POSITION                    equ 0000h
PWM3TMRH_TMR_SIZE                        equ 0008h
PWM3TMRH_TMR_LENGTH                      equ 0008h
PWM3TMRH_TMR_MASK                        equ 00FFh
PWM3TMRH_PWM3TMRH0_POSN                  equ 0000h
PWM3TMRH_PWM3TMRH0_POSITION              equ 0000h
PWM3TMRH_PWM3TMRH0_SIZE                  equ 0001h
PWM3TMRH_PWM3TMRH0_LENGTH                equ 0001h
PWM3TMRH_PWM3TMRH0_MASK                  equ 0001h
PWM3TMRH_PWM3TMRH1_POSN                  equ 0001h
PWM3TMRH_PWM3TMRH1_POSITION              equ 0001h
PWM3TMRH_PWM3TMRH1_SIZE                  equ 0001h
PWM3TMRH_PWM3TMRH1_LENGTH                equ 0001h
PWM3TMRH_PWM3TMRH1_MASK                  equ 0002h
PWM3TMRH_PWM3TMRH2_POSN                  equ 0002h
PWM3TMRH_PWM3TMRH2_POSITION              equ 0002h
PWM3TMRH_PWM3TMRH2_SIZE                  equ 0001h
PWM3TMRH_PWM3TMRH2_LENGTH                equ 0001h
PWM3TMRH_PWM3TMRH2_MASK                  equ 0004h
PWM3TMRH_PWM3TMRH3_POSN                  equ 0003h
PWM3TMRH_PWM3TMRH3_POSITION              equ 0003h
PWM3TMRH_PWM3TMRH3_SIZE                  equ 0001h
PWM3TMRH_PWM3TMRH3_LENGTH                equ 0001h
PWM3TMRH_PWM3TMRH3_MASK                  equ 0008h
PWM3TMRH_PWM3TMRH4_POSN                  equ 0004h
PWM3TMRH_PWM3TMRH4_POSITION              equ 0004h
PWM3TMRH_PWM3TMRH4_SIZE                  equ 0001h
PWM3TMRH_PWM3TMRH4_LENGTH                equ 0001h
PWM3TMRH_PWM3TMRH4_MASK                  equ 0010h
PWM3TMRH_PWM3TMRH5_POSN                  equ 0005h
PWM3TMRH_PWM3TMRH5_POSITION              equ 0005h
PWM3TMRH_PWM3TMRH5_SIZE                  equ 0001h
PWM3TMRH_PWM3TMRH5_LENGTH                equ 0001h
PWM3TMRH_PWM3TMRH5_MASK                  equ 0020h
PWM3TMRH_PWM3TMRH6_POSN                  equ 0006h
PWM3TMRH_PWM3TMRH6_POSITION              equ 0006h
PWM3TMRH_PWM3TMRH6_SIZE                  equ 0001h
PWM3TMRH_PWM3TMRH6_LENGTH                equ 0001h
PWM3TMRH_PWM3TMRH6_MASK                  equ 0040h
PWM3TMRH_PWM3TMRH7_POSN                  equ 0007h
PWM3TMRH_PWM3TMRH7_POSITION              equ 0007h
PWM3TMRH_PWM3TMRH7_SIZE                  equ 0001h
PWM3TMRH_PWM3TMRH7_LENGTH                equ 0001h
PWM3TMRH_PWM3TMRH7_MASK                  equ 0080h
PWM3TMRH_PWM3TMRH_POSN                   equ 0000h
PWM3TMRH_PWM3TMRH_POSITION               equ 0000h
PWM3TMRH_PWM3TMRH_SIZE                   equ 0008h
PWM3TMRH_PWM3TMRH_LENGTH                 equ 0008h
PWM3TMRH_PWM3TMRH_MASK                   equ 00FFh

// Register: PWM3CON
#define PWM3CON PWM3CON
PWM3CON                                  equ 0DBBh
// bitfield definitions
PWM3CON_MODE_POSN                        equ 0002h
PWM3CON_MODE_POSITION                    equ 0002h
PWM3CON_MODE_SIZE                        equ 0002h
PWM3CON_MODE_LENGTH                      equ 0002h
PWM3CON_MODE_MASK                        equ 000Ch
PWM3CON_POL_POSN                         equ 0004h
PWM3CON_POL_POSITION                     equ 0004h
PWM3CON_POL_SIZE                         equ 0001h
PWM3CON_POL_LENGTH                       equ 0001h
PWM3CON_POL_MASK                         equ 0010h
PWM3CON_OUT_POSN                         equ 0005h
PWM3CON_OUT_POSITION                     equ 0005h
PWM3CON_OUT_SIZE                         equ 0001h
PWM3CON_OUT_LENGTH                       equ 0001h
PWM3CON_OUT_MASK                         equ 0020h
PWM3CON_OE_POSN                          equ 0006h
PWM3CON_OE_POSITION                      equ 0006h
PWM3CON_OE_SIZE                          equ 0001h
PWM3CON_OE_LENGTH                        equ 0001h
PWM3CON_OE_MASK                          equ 0040h
PWM3CON_EN_POSN                          equ 0007h
PWM3CON_EN_POSITION                      equ 0007h
PWM3CON_EN_SIZE                          equ 0001h
PWM3CON_EN_LENGTH                        equ 0001h
PWM3CON_EN_MASK                          equ 0080h
PWM3CON_PWM3MODE0_POSN                   equ 0002h
PWM3CON_PWM3MODE0_POSITION               equ 0002h
PWM3CON_PWM3MODE0_SIZE                   equ 0001h
PWM3CON_PWM3MODE0_LENGTH                 equ 0001h
PWM3CON_PWM3MODE0_MASK                   equ 0004h
PWM3CON_PWM3MODE1_POSN                   equ 0003h
PWM3CON_PWM3MODE1_POSITION               equ 0003h
PWM3CON_PWM3MODE1_SIZE                   equ 0001h
PWM3CON_PWM3MODE1_LENGTH                 equ 0001h
PWM3CON_PWM3MODE1_MASK                   equ 0008h
PWM3CON_PWM3MODE_POSN                    equ 0002h
PWM3CON_PWM3MODE_POSITION                equ 0002h
PWM3CON_PWM3MODE_SIZE                    equ 0002h
PWM3CON_PWM3MODE_LENGTH                  equ 0002h
PWM3CON_PWM3MODE_MASK                    equ 000Ch
PWM3CON_PWM3POL_POSN                     equ 0004h
PWM3CON_PWM3POL_POSITION                 equ 0004h
PWM3CON_PWM3POL_SIZE                     equ 0001h
PWM3CON_PWM3POL_LENGTH                   equ 0001h
PWM3CON_PWM3POL_MASK                     equ 0010h
PWM3CON_PWM3OUT_POSN                     equ 0005h
PWM3CON_PWM3OUT_POSITION                 equ 0005h
PWM3CON_PWM3OUT_SIZE                     equ 0001h
PWM3CON_PWM3OUT_LENGTH                   equ 0001h
PWM3CON_PWM3OUT_MASK                     equ 0020h
PWM3CON_PWM3OE_POSN                      equ 0006h
PWM3CON_PWM3OE_POSITION                  equ 0006h
PWM3CON_PWM3OE_SIZE                      equ 0001h
PWM3CON_PWM3OE_LENGTH                    equ 0001h
PWM3CON_PWM3OE_MASK                      equ 0040h
PWM3CON_PWM3EN_POSN                      equ 0007h
PWM3CON_PWM3EN_POSITION                  equ 0007h
PWM3CON_PWM3EN_SIZE                      equ 0001h
PWM3CON_PWM3EN_LENGTH                    equ 0001h
PWM3CON_PWM3EN_MASK                      equ 0080h
PWM3CON_MODE0_POSN                       equ 0002h
PWM3CON_MODE0_POSITION                   equ 0002h
PWM3CON_MODE0_SIZE                       equ 0001h
PWM3CON_MODE0_LENGTH                     equ 0001h
PWM3CON_MODE0_MASK                       equ 0004h
PWM3CON_MODE1_POSN                       equ 0003h
PWM3CON_MODE1_POSITION                   equ 0003h
PWM3CON_MODE1_SIZE                       equ 0001h
PWM3CON_MODE1_LENGTH                     equ 0001h
PWM3CON_MODE1_MASK                       equ 0008h

// Register: PWM3INTE
#define PWM3INTE PWM3INTE
PWM3INTE                                 equ 0DBCh
// bitfield definitions
PWM3INTE_PRIE_POSN                       equ 0000h
PWM3INTE_PRIE_POSITION                   equ 0000h
PWM3INTE_PRIE_SIZE                       equ 0001h
PWM3INTE_PRIE_LENGTH                     equ 0001h
PWM3INTE_PRIE_MASK                       equ 0001h
PWM3INTE_DCIE_POSN                       equ 0001h
PWM3INTE_DCIE_POSITION                   equ 0001h
PWM3INTE_DCIE_SIZE                       equ 0001h
PWM3INTE_DCIE_LENGTH                     equ 0001h
PWM3INTE_DCIE_MASK                       equ 0002h
PWM3INTE_PHIE_POSN                       equ 0002h
PWM3INTE_PHIE_POSITION                   equ 0002h
PWM3INTE_PHIE_SIZE                       equ 0001h
PWM3INTE_PHIE_LENGTH                     equ 0001h
PWM3INTE_PHIE_MASK                       equ 0004h
PWM3INTE_OFIE_POSN                       equ 0003h
PWM3INTE_OFIE_POSITION                   equ 0003h
PWM3INTE_OFIE_SIZE                       equ 0001h
PWM3INTE_OFIE_LENGTH                     equ 0001h
PWM3INTE_OFIE_MASK                       equ 0008h
PWM3INTE_PWM3PRIE_POSN                   equ 0000h
PWM3INTE_PWM3PRIE_POSITION               equ 0000h
PWM3INTE_PWM3PRIE_SIZE                   equ 0001h
PWM3INTE_PWM3PRIE_LENGTH                 equ 0001h
PWM3INTE_PWM3PRIE_MASK                   equ 0001h
PWM3INTE_PWM3DCIE_POSN                   equ 0001h
PWM3INTE_PWM3DCIE_POSITION               equ 0001h
PWM3INTE_PWM3DCIE_SIZE                   equ 0001h
PWM3INTE_PWM3DCIE_LENGTH                 equ 0001h
PWM3INTE_PWM3DCIE_MASK                   equ 0002h
PWM3INTE_PWM3PHIE_POSN                   equ 0002h
PWM3INTE_PWM3PHIE_POSITION               equ 0002h
PWM3INTE_PWM3PHIE_SIZE                   equ 0001h
PWM3INTE_PWM3PHIE_LENGTH                 equ 0001h
PWM3INTE_PWM3PHIE_MASK                   equ 0004h
PWM3INTE_PWM3OFIE_POSN                   equ 0003h
PWM3INTE_PWM3OFIE_POSITION               equ 0003h
PWM3INTE_PWM3OFIE_SIZE                   equ 0001h
PWM3INTE_PWM3OFIE_LENGTH                 equ 0001h
PWM3INTE_PWM3OFIE_MASK                   equ 0008h

// Register: PWM3INTF
#define PWM3INTF PWM3INTF
PWM3INTF                                 equ 0DBDh
// bitfield definitions
PWM3INTF_PRIF_POSN                       equ 0000h
PWM3INTF_PRIF_POSITION                   equ 0000h
PWM3INTF_PRIF_SIZE                       equ 0001h
PWM3INTF_PRIF_LENGTH                     equ 0001h
PWM3INTF_PRIF_MASK                       equ 0001h
PWM3INTF_DCIF_POSN                       equ 0001h
PWM3INTF_DCIF_POSITION                   equ 0001h
PWM3INTF_DCIF_SIZE                       equ 0001h
PWM3INTF_DCIF_LENGTH                     equ 0001h
PWM3INTF_DCIF_MASK                       equ 0002h
PWM3INTF_PHIF_POSN                       equ 0002h
PWM3INTF_PHIF_POSITION                   equ 0002h
PWM3INTF_PHIF_SIZE                       equ 0001h
PWM3INTF_PHIF_LENGTH                     equ 0001h
PWM3INTF_PHIF_MASK                       equ 0004h
PWM3INTF_OFIF_POSN                       equ 0003h
PWM3INTF_OFIF_POSITION                   equ 0003h
PWM3INTF_OFIF_SIZE                       equ 0001h
PWM3INTF_OFIF_LENGTH                     equ 0001h
PWM3INTF_OFIF_MASK                       equ 0008h
PWM3INTF_PWM3PRIF_POSN                   equ 0000h
PWM3INTF_PWM3PRIF_POSITION               equ 0000h
PWM3INTF_PWM3PRIF_SIZE                   equ 0001h
PWM3INTF_PWM3PRIF_LENGTH                 equ 0001h
PWM3INTF_PWM3PRIF_MASK                   equ 0001h
PWM3INTF_PWM3DCIF_POSN                   equ 0001h
PWM3INTF_PWM3DCIF_POSITION               equ 0001h
PWM3INTF_PWM3DCIF_SIZE                   equ 0001h
PWM3INTF_PWM3DCIF_LENGTH                 equ 0001h
PWM3INTF_PWM3DCIF_MASK                   equ 0002h
PWM3INTF_PWM3PHIF_POSN                   equ 0002h
PWM3INTF_PWM3PHIF_POSITION               equ 0002h
PWM3INTF_PWM3PHIF_SIZE                   equ 0001h
PWM3INTF_PWM3PHIF_LENGTH                 equ 0001h
PWM3INTF_PWM3PHIF_MASK                   equ 0004h
PWM3INTF_PWM3OFIF_POSN                   equ 0003h
PWM3INTF_PWM3OFIF_POSITION               equ 0003h
PWM3INTF_PWM3OFIF_SIZE                   equ 0001h
PWM3INTF_PWM3OFIF_LENGTH                 equ 0001h
PWM3INTF_PWM3OFIF_MASK                   equ 0008h

// Register: PWM3CLKCON
#define PWM3CLKCON PWM3CLKCON
PWM3CLKCON                               equ 0DBEh
// bitfield definitions
PWM3CLKCON_CS_POSN                       equ 0000h
PWM3CLKCON_CS_POSITION                   equ 0000h
PWM3CLKCON_CS_SIZE                       equ 0002h
PWM3CLKCON_CS_LENGTH                     equ 0002h
PWM3CLKCON_CS_MASK                       equ 0003h
PWM3CLKCON_PS_POSN                       equ 0004h
PWM3CLKCON_PS_POSITION                   equ 0004h
PWM3CLKCON_PS_SIZE                       equ 0003h
PWM3CLKCON_PS_LENGTH                     equ 0003h
PWM3CLKCON_PS_MASK                       equ 0070h
PWM3CLKCON_PWM3CS0_POSN                  equ 0000h
PWM3CLKCON_PWM3CS0_POSITION              equ 0000h
PWM3CLKCON_PWM3CS0_SIZE                  equ 0001h
PWM3CLKCON_PWM3CS0_LENGTH                equ 0001h
PWM3CLKCON_PWM3CS0_MASK                  equ 0001h
PWM3CLKCON_PWM3CS1_POSN                  equ 0001h
PWM3CLKCON_PWM3CS1_POSITION              equ 0001h
PWM3CLKCON_PWM3CS1_SIZE                  equ 0001h
PWM3CLKCON_PWM3CS1_LENGTH                equ 0001h
PWM3CLKCON_PWM3CS1_MASK                  equ 0002h
PWM3CLKCON_PWM3PS0_POSN                  equ 0004h
PWM3CLKCON_PWM3PS0_POSITION              equ 0004h
PWM3CLKCON_PWM3PS0_SIZE                  equ 0001h
PWM3CLKCON_PWM3PS0_LENGTH                equ 0001h
PWM3CLKCON_PWM3PS0_MASK                  equ 0010h
PWM3CLKCON_PWM3PS1_POSN                  equ 0005h
PWM3CLKCON_PWM3PS1_POSITION              equ 0005h
PWM3CLKCON_PWM3PS1_SIZE                  equ 0001h
PWM3CLKCON_PWM3PS1_LENGTH                equ 0001h
PWM3CLKCON_PWM3PS1_MASK                  equ 0020h
PWM3CLKCON_PWM3PS2_POSN                  equ 0006h
PWM3CLKCON_PWM3PS2_POSITION              equ 0006h
PWM3CLKCON_PWM3PS2_SIZE                  equ 0001h
PWM3CLKCON_PWM3PS2_LENGTH                equ 0001h
PWM3CLKCON_PWM3PS2_MASK                  equ 0040h
PWM3CLKCON_PWM3CS_POSN                   equ 0000h
PWM3CLKCON_PWM3CS_POSITION               equ 0000h
PWM3CLKCON_PWM3CS_SIZE                   equ 0003h
PWM3CLKCON_PWM3CS_LENGTH                 equ 0003h
PWM3CLKCON_PWM3CS_MASK                   equ 0007h
PWM3CLKCON_PWM3PS_POSN                   equ 0004h
PWM3CLKCON_PWM3PS_POSITION               equ 0004h
PWM3CLKCON_PWM3PS_SIZE                   equ 0003h
PWM3CLKCON_PWM3PS_LENGTH                 equ 0003h
PWM3CLKCON_PWM3PS_MASK                   equ 0070h
PWM3CLKCON_CS0_POSN                      equ 0000h
PWM3CLKCON_CS0_POSITION                  equ 0000h
PWM3CLKCON_CS0_SIZE                      equ 0001h
PWM3CLKCON_CS0_LENGTH                    equ 0001h
PWM3CLKCON_CS0_MASK                      equ 0001h
PWM3CLKCON_CS1_POSN                      equ 0001h
PWM3CLKCON_CS1_POSITION                  equ 0001h
PWM3CLKCON_CS1_SIZE                      equ 0001h
PWM3CLKCON_CS1_LENGTH                    equ 0001h
PWM3CLKCON_CS1_MASK                      equ 0002h
PWM3CLKCON_PS0_POSN                      equ 0004h
PWM3CLKCON_PS0_POSITION                  equ 0004h
PWM3CLKCON_PS0_SIZE                      equ 0001h
PWM3CLKCON_PS0_LENGTH                    equ 0001h
PWM3CLKCON_PS0_MASK                      equ 0010h
PWM3CLKCON_PS1_POSN                      equ 0005h
PWM3CLKCON_PS1_POSITION                  equ 0005h
PWM3CLKCON_PS1_SIZE                      equ 0001h
PWM3CLKCON_PS1_LENGTH                    equ 0001h
PWM3CLKCON_PS1_MASK                      equ 0020h
PWM3CLKCON_PS2_POSN                      equ 0006h
PWM3CLKCON_PS2_POSITION                  equ 0006h
PWM3CLKCON_PS2_SIZE                      equ 0001h
PWM3CLKCON_PS2_LENGTH                    equ 0001h
PWM3CLKCON_PS2_MASK                      equ 0040h

